Repository: ibrahimEltayfe/live_tracking_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Email
ar: البريد الإلكترونى

source: Password
ar: كلمة السر

source: Forgot Password
ar: نسيت كلمة السر

# enterYourEmail
source: Enter you email
ar: اكتب بريدك الإلكترونى

source: Login
ar: دخول

source: Register
ar: تسجيل

source: Do not have an account?
ar: لا تمتلك حساب؟

# alreadyHaveAnAccount
source: Do you have an account?
ar: هل تمتلك حساب؟

source: OR
ar: أو

# resetPassword
source: Reset Your Password
ar: إعادة تعيين كلمة السر

# verifyEmailMessage
source: Please click on the link sent to your email to verify.
ar: من فضلك إضغط على الرابط الذى تم إرساله إلى بريدك الإلكترونى للتفعيل

source: Done
ar: تم

source: Add Session
ar: إضافة جلسة

source: Session Password
ar: كلمة المرور

source: Session Name
ar: اسم الجلسة

# intervals
source: Update Location Every(in seconds):
ar: تحديث بيانات الموقع كل (بالثانية):

source: Name
ar: الاسم

source: Change Password
ar: تغيير كلمة السر

source: Edit Profile
ar: تعديل الملف الشخصي

source: App Setting
ar: إعدادات التطبيق

source: About
ar: حول

source: Logout
ar: تسجيل الخروج

source: Tracking Sessions
ar: جلسات التتبع

# unExpectedError
source: something went wrong, please try again later.
ar: حدث خطأ, برجاء المحاولة مرة اخرى.

# noInternetError
source: no internet
ar: لا يوجد انترنت

# noUIDError
source: session ended, please login.
ar: انتهت صلاحية الجلسة, برجاء تسجيل الدخول

# pickFileError
source: failed picking a file.
ar: حدث خطأ, لم نتمكن من جلب الملف

# dioBadRequest
source: bad request, Try again later
ar: حدث خطأ عند إرسال الطلب

# dioUnAuthorized
source: user is un authorized
ar: طلب غير مصرح به

# dioForbidden
source: server rejected the request, Try again later
ar: السيرفر رفض الطلب, برجاء المحاولة مرة اخرى

# dioRequestTimeout
source: time out, please try again later
ar: الطلب اخذ وقتا كثيرا, برجاء المحاولة مرة اخرى

# dioInternalServerError
source: server error, please try again later
ar: هناك خطأ بالسيرفر, برجاء المحاولة مرة اخرى

# dioNotFound
source: page not found, please try again later
ar: الصفحة غير موجودة, برجاء المحاولة مرة اخرى

# userDisabled
source: This user has been disabled. contact support for help.
ar: هذا الحساب متوقف, برجاء مراسلتنا لمعرفة السبب.

# userNotFound
source: Email is not found.
ar: البريد الالكترونى غير موجود.

# wrongPassword
source: Incorrect password, please try again.
ar: كلمة مرور غير صحيحة

# invalidEmail
source: the email address is malformed.
ar: البريد الالكترونى غير صالح

# loginDefaultError
source: Login Error.. please try again
ar: حدث خطأ عند تسجيل الدخول, برجاء المحاولة مرة اخرى

# weakPassword
source: the password is not strong enough.
ar: كلمة السر ليست قوية

# emailAlreadyInUse
source: the email is already in use by a different account.
ar: البريد الإلكتروني قيد الاستخدام بالفعل من قبل حساب مختلف

# registerDefaultError
source: Register Error.. please try again
ar: حدث خطأ عند التسجيل, برجاء المحاولة مرة اخرى

# accountExistsWithDifferentCredential
source: Account exists with different credentials.
ar: الحساب موجود ببيانات مختلفة

# invalidCredential
source: The credential received is malformed or has expired.
ar: البيانات المتلقاة غير صحيحة أو منتهية الصلاحية

# operationNotAllowed
source: Operation is not allowed. Please contact support.
ar: العملية غير مسموح بها

# invalidVerificationCode
source: The credential verification code received is invalid.
ar: رمز التحقق غير صالح.

# invalidVerificationId
source: The credential verification ID received is invalid.
ar: رمز التحقق من البيانات غير صالح

# credentialDefaultError
source: something went wrong.. please try again
ar: حدث خطأ, برجاء المحاولة مرة اخرى

# expiredActionCode
source: the password reset code has expired.
ar: انتهت صلاحية رمز إعادة تعيين كلمة المرور

# invalidActionCode
source: the password reset code is invalid.
ar: رمز إعادة تعيين كلمة المرور غير صالح.

# userDisabledResetPassword
source: the user corresponding to the given password reset code has been disabled.
ar: البريد الالكترونى التابع لهذا الرمز متوقف.

# userNotFoundResetPassword
source: there is no user corresponding to the password reset code.
ar: لا يوجد مستخدم مطابق لرمز إعادة تعيين كلمة المرور.

# resetPasswordDefaultError
source: Error when resetting your password.. please try again
ar: خطأ عند إعادة تعيين كلمة المرور الخاصة بك .. يرجى المحاولة مرة أخرى

# errorUserNotFound
source: there is no user corresponding to the given email address.
ar: لا يوجد مستخدم مطابق لعنوان البريد الإلكتروني المحدد.

# emailIsEmptyError
source: please enter your email
ar: من فضلك ادخل البريد الإلكترونى

# passwordIsEmptyError
source: please enter your password
ar: من فضلك ادخل كلمة السر

# nameIsEmptyError
source: please enter your name
ar: من فضلك ادخل اسمك

# fieldIsEmptyError
source: this field is required
ar: هذا الحقل مطلوب

# passwordLengthError
source: please enter at least {length} letters
ar: من فضلك ادخل على الأقل {length} أرقام أو حروف

# nameLengthError
source: this field can not exceed {length} letters
ar: هذا الحقل يجب أن لا يتعدى {length} حرف

# sessionPasswordLengthError
source: please enter at least {length} letters
ar: من فضلك ادخل على الأقل {length} أرقام أو حروف

# sessionNameLengthError
source: this field can not exceed {length} letters
ar: هذا الحقل يجب أن لا يتعدى {length} حرف

# sessionPasswordIsEmptyError
source: please enter a session password
ar: من فضلك ادخل كلمة سر للجلسة

# sessionNameIsEmptyError
source: please enter a session name
ar: من فضلك ادخل اسم للجلسة

# sessionNameIsUsedError
source: this name is used, please try another one.
ar: هذا الاسم مستخدم, من فضلك ادخل اسم اخر

# emailNotVerified
source: Email is not verified
ar: البريد الإلكترونى غير مفعل

# sendingVerificationEmail
source: Sending the verification link to your email..
ar: يتم إرسال رابط التفعيل لبريدك الإلكترونى..

# resetPasswordLinkSent
source: Your reset password link sent to your account.
ar: تم إرسال رابط إعادة تعيين كلمة المرور الخاصة بك الى بريدك الإلكترونى

# noDataError
source: No Data Found.
ar: لا توجد معلومات حالية.
